# n = int(input('Введите значение месяца в формате 1 -12: '))
#
# if n in (1, 2, 3):
#     print('Это зима!')
# else:
#     n = int(input('Введите значение месяца в формате 1 -12: '))

w = [1, 2, 3]
sp = [4, 5, 6]
su = [7, 8, 9]
au = [10, 11, 12]

n = int(input('Введите значение месяца в формате 1 -12: '))

if n in w:
    print('Это зима!')
elif n in sp:
    print('Это весна!')
elif n in su:
    print('Это лето!')
elif n in au:
    print('Это осень!')
else:
    n = int(input('Вы ввели некорректное число!'))